#lang racket

;----------- INÍCIO TRECHOS DE CÓDIGO COMUNS ENTRE EXERCÍCIOS ------------;



;----------- FIM TRECHOS DE CÓDIGO COMUNS ENTRE EXERCÍCIOS ------------;


;;;;;;;;;;;;;;;;;;;;;;
;; Exercício 3.1

;;
;;
;;

;;;;;;;;;;;;;;;;;;;;;;
;; Exercício 3.2

;;
;;
;;

;;;;;;;;;;;;;;;;;;;;;;
;; Exercício 3.7

;;
;;
;;

;;;;;;;;;;;;;;;;;;;;;;
;; Exercício 3.8

;;
;;
;;

;;;;;;;;;;;;;;;;;;;;;;
;; Exercício 3.11

;;
;;
;;

;;;;;;;;;;;;;;;;;;;;;;
;; Exercício 3.12

;;
;;
;;

;;;;;;;;;;;;;;;;;;;;;;
;; Exercício 3.13

;;
;;
;;

;;;;;;;;;;;;;;;;;;;;;;
;; Exercício 3.15

;;
;;
;;

;;;;;;;;;;;;;;;;;;;;;;
;; Exercício 3.16

;;
;;
;;

;;;;;;;;;;;;;;;;;;;;;;
;; Exercício 3.17

;;
;;
;;

